{
    "version": "https://jsonfeed.org/version/1",
    "title": "aylin&#x27;s autistic resource database &lt;3",
    "description": "",
    "home_page_url": "https://aylins-autisticresources.org",
    "feed_url": "https://aylins-autisticresources.org/feed.json",
    "user_comment": "",
    "icon": "https://aylins-autisticresources.org/media/website/header-stars-2.png",
    "author": {
        "name": "emily"
    },
    "items": [
        {
            "id": "https://aylins-autisticresources.org/how-we-feel/",
            "url": "https://aylins-autisticresources.org/how-we-feel/",
            "title": "How We Feel",
            "summary": "How We Feel is a mobile journaling app designed by therapists and scientists at the Yale University Center for Emotional&hellip;",
            "content_html": "<h5><span style=\"text-decoration: underline;\"><a href=\"https://howwefeel.org/\">How We Feel</a></span> is a mobile journaling app designed by therapists and scientists at the <span style=\"text-decoration: underline;\"><a href=\"http://ycei.org/\" target=\"_blank\" data-v-735c43b9=\"\" rel=\"noopener\">Yale University Center for Emotional Intelligence</a></span> to help you name and track your emotions throughout the day.</h5>\n<p>The app taps you on the shoulder (via notifications) once or twice a day, or however frequently you want it to, and asks how you're feeling in that moment. You can type it in the search bar if you already have a word for what you're feeling.</p>\n<p>But if you need help naming it, you can browse through the emotions on the feelings wheel, which are organized by <strong><em>arousal </em></strong>(high or low) and <strong><em>valence </em></strong>(positive or negative). For example, \"excited\" is listed as a high energy, pleasant emotion, whereas \"disconnected\" is a low energy, unpleasant emotion.</p>\n<p>Each emotion has a specific description, which is helpful for choosing between similar feelings, such as \"angry\" and \"furious.\" The differences can be somewhat subjective, but I usually at least somewhat agree with their definitions.</p>\n<p>Once you choose a feeling, you're asked what might be making you feel that way. You can quickly choose customizable tags for themes (e.g. driving, resting, eating), people (e.g. friends, family, co-workers), and places (e.g. home, school, work). This has helped me notice how certain situations and activities consistently make me feel.</p>\n<blockquote>\n<p>How We Feel is especially handy for people with alexithymia, which can make it hard to recognize or describe your feelings.</p>\n<p>When there's literally a log of your emotions and what caused them colorfully staring you in the face, it's pretty hard to deny the patterns that show up.</p>\n</blockquote>\n<p>The design of the app is beautiful and easy to use as well, with each emotion taking a unique shape evocative of that feeling. It's available on <span style=\"text-decoration: underline;\"><a href=\"https://play.google.com/store/apps/details?id=org.howwefeel.moodmeter&amp;hl=en_US\">Android</a></span> and <a href=\"https://apps.apple.com/us/app/how-we-feel/id1562706384\">Apple</a> devices for free.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/7/howwefeel2.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Mobile App"
            ],
            "date_published": "2026-01-30T17:12:01-08:00",
            "date_modified": "2026-01-30T17:46:07-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-3/",
            "url": "https://aylins-autisticresources.org/post-3/",
            "title": "I&#x27;m Autistic, Now What?",
            "summary": "I'm Autistic, Now What? is a YouTube channel run by Meg, a late-diagnosed PDA AuDHD woman from the UK. Meg&hellip;",
            "content_html": "<h5><em><span style=\"text-decoration: underline;\"><a href=\"https://www.youtube.com/@imautisticnowwhat/playlists\">I'm Autistic, Now What?</a></span></em> is a YouTube channel run by Meg, a late-diagnosed PDA AuDHD woman from the UK. Meg is one of the most well-known autistic YouTubers out there, for good reason.</h5>\n<p>She has videos on signs that you might have autism, ADHD, PDA, and/or dyspraxia, as well as signs that you might NOT be neurodivergent in these ways. In addition, her videos on monotropism and masking are excellent introductions to the topics, and her advice videos are always quite thorough. She also has a neurotypical partner and child, which gives her an interesting perspective.</p>\n<p>This channel is especially great for people who have just been diagnosed or are questioning their neurotype. The title <em>I'm Autistic, Now What?</em> refers to the all-too-common experience of finally finding out you're autistic — and then being left with no support, just a slap on the back and a \"good luck, buddy!\" (If that. :)</p>\n<blockquote>\n<p><em>With her channel, Meg is trying to correct that by providing a safe space for people figuring out how to live a better autistic life post-diagnosis.</em></p>\n<p><em><span style=\"font-family: sans-serif; font-size: inherit;\">It's clear that Meg puts a lot of time and effort into researching these videos, citing her sources, and talking about autism in a charming, relatable, and accurate way.</span></em></p>\n</blockquote>\n<p>I recommend her <span style=\"text-decoration: underline;\"><a href=\"https://www.youtube.com/playlist?list=PLEHi2YmjD7gEssdqTn0247t_niQMt2b22\">meme compilation</a></span> videos when you need a good autistic chuckle amidst the world's darkness. Also, note that some of her videos have sarcastic titles quoting other people's questionable statements that she is, of course, arguing against.</p>\n<p>Meg has a <span style=\"text-decoration: underline;\"><a href=\"https://www.patreon.com/imautisticnowwhat\">Patreon</a></span> where she offers access to her Discord server at a very low price, and sometimes she releases merch, like Anti-Social Snail pins and stickers. Overall, her channel is a fun way to engage with the autistic community, learn something, and feel like maybe we're not all totally screwed.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/6/meg-2.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Youtube",
                   "Persistent Drive for Autonomy (PDA)",
                   "AuDHD"
            ],
            "date_published": "2026-01-11T18:08:13-08:00",
            "date_modified": "2026-01-30T17:15:48-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-2/",
            "url": "https://aylins-autisticresources.org/post-2/",
            "title": "AuCT - What is Autistic-Centered Therapy?",
            "summary": "Autistic-Centered Therapy (AuCT) is a kind of therapy designed by and for autistic people. According to Matt Lowry, LPP, it's&hellip;",
            "content_html": "<h5><a href=\"https://www.mattlowrylpp.com/blog/act-83tka\"><span style=\"font-weight: 400;\">Autistic-Centered Therapy</span><span style=\"font-weight: 400;\"> (AuCT)</span></a><span style=\"font-weight: 400;\"> is a kind of therapy designed by and for autistic people. According to Matt Lowry, LPP, it's \"equal parts trauma work, advocacy work, autistic interpersonal therapy, and automotive [body] maintenance.\"</span></h5>\n<p><span style=\"font-weight: 400;\">I came across the idea of autistic-centered therapy through Matt Lowry, LPP and Dr. Angela Kingdon's Autistic Culture Podcast, where they did an </span><span style=\"text-decoration: underline;\"><a href=\"https://www.autisticculturepodcast.com/p/autistic-podcast-autistic-centered-therapy\"><span style=\"font-weight: 400;\">episode about AuCT</span></a></span><span style=\"font-weight: 400;\">. It reimagines what therapy might look like if it affirmed neurodivergence, encouraged autistic coping strategies, and were administered by an autistic therapist who understands and </span><span style=\"font-weight: 400;\">uses</span><span style=\"font-weight: 400;\"> autistic communication styles themselves.</span></p>\n<p><span style=\"font-weight: 400;\">The most common kind of therapy in the US is Cognitive Behavioral Therapy (CBT), and my personal experience as an autistic person is that multiple facets of it simply do not work for me. In some cases, they can actually harm my mental health, even if delivered with nothing but good intentions. These sentiments have been echoed by many autistic people who find that most available types of therapy are either made for neurotypical/allistic people or attempts to \"fix\" our autism. Neither is ideal!</span></p>\n<blockquote>\n<p><em><span style=\"font-weight: 400;\">The concept of AuCT gives me some hope for a world where autism-affirming therapy is accessible to anyone who needs it.</span></em></p>\n</blockquote>\n<p><span style=\"font-weight: 400;\">It made me feel much more educated on what to look for when searching for a therapist myself. Thus, I highly recommend this article and podcast episode to any autistic person who feels like traditional therapy might not be for them, as well as any clinician interested in learning more about how to support autistic clients.</span></p>",
            "image": "https://aylins-autisticresources.org/media/posts/5/AuCT.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Podcasts",
                   "Neuro-Affirming Therapy",
                   "Articles"
            ],
            "date_published": "2026-01-11T18:08:10-08:00",
            "date_modified": "2026-01-30T16:58:11-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-1/",
            "url": "https://aylins-autisticresources.org/post-1/",
            "title": "Me and Monotropism: A unified theory of autism",
            "summary": "Monotropism is a unified theory of autism created by autistic people that explains autistic traits in terms of \"monotropic,\" or&hellip;",
            "content_html": "<h5>Monotropism is a <span style=\"text-decoration: underline;\"><a href=\"https://www.bps.org.uk/psychologist/me-and-monotropism-unified-theory-autism\">unified theory of autism</a></span> created by autistic people that explains autistic traits in terms of \"monotropic,\" or singularly and intensely focused, attention.</h5>\n<p>It was developed by Dr. Dinah Murray, Dr. Wenn Lawson, and Mike Lesser. This article about it was written by Dr. Murray's adult child, Fergus Murray, both of whom were/are autistic themselves.</p>\n<p>Many people's understanding of autism is still extremely deficit-based. On the other hand, the theory of monotropism is one of the first, most prominent theories of autism that sees autistic traits primarily as differences, not deficiencies.</p>\n<blockquote>\n<p><em>When I was still confused about whether I was autistic or not, reading this article was what made it all make sense. It does a shockingly cohesive job of tying seemingly disparate autistic traits together with the common thread of singular, intense focus.</em></p>\n<p><em>I've recommended it to countless people since when trying to explain the root of what autism is all about, as I think it's a great starting point.</em></p>\n</blockquote>\n<p>Fergus Murray also has a website called <span style=\"text-decoration: underline;\"><a href=\"https://monotropism.org/\">monotropism.org</a></span> with more details on the history of the theory, its applications, and other articles and papers on monotropism.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/4/trees.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2026-01-10T19:11:44-08:00",
            "date_modified": "2026-01-30T16:56:26-08:00"
        }
    ]
}
