{
    "version": "https://jsonfeed.org/version/1",
    "title": "aylin&#x27;s autistic resource database &lt;3",
    "description": "",
    "home_page_url": "https://aylins-autisticresources.org",
    "feed_url": "https://aylins-autisticresources.org/feed.json",
    "user_comment": "",
    "icon": "https://aylins-autisticresources.org/media/website/header-stars-2.png",
    "author": {
        "name": "emily"
    },
    "items": [
        {
            "id": "https://aylins-autisticresources.org/inclusivetherapistscom/",
            "url": "https://aylins-autisticresources.org/inclusivetherapistscom/",
            "title": "Inclusive Therapists",
            "summary": "Inclusive Therapists is a website to help you find affirming, social justice-oriented mental health providers with certain identities and specialties.",
            "content_html": "<h5><span style=\"text-decoration: underline;\"><a href=\"https://www.inclusivetherapists.com/\">Inclusive Therapists</a></span> is a website to help you find affirming, social justice-oriented mental health providers with certain identities and specialties.</h5>\n<p>This website states that they are a \"mental health liberation movement creating change through <strong>decolonial education, collective care, and activism</strong>.\" Even today, a lot of therapy is not so <a href=\"https://www.decolonizingtherapy.com/\"><span style=\"text-decoration: underline;\">decolonized</span></a>, so such a mission statement is a damn good sign. They also have anti-carceral <span style=\"text-decoration: underline;\"><a href=\"https://www.inclusivetherapists.com/resources\">mental health resources</a></span> and a <a href=\"https://mentalhealthliberation.org/\"><span style=\"text-decoration: underline;\">nonprofit organization</span></a>.</p>\n<p>You can search for providers by Advocacy Focus, Cultural Identity, Language, Provider's Identity, and more. Each therapist adds tags to show their <strong>services/therapeutic approaches</strong> (e.g. body positivity, gender-affirming care letters, disability justice, etc.) and <strong>their own identities</strong> (e.g. biracial/multiracial, person of color or global majority, LGBQ+ sexuality, transgender, etc.). And if you want more direct help, you can fill out a form via their free <a href=\"https://www.inclusivetherapists.com/get-matched\"><span style=\"text-decoration: underline;\">matching service</span></a>.</p>\n<blockquote>\n<p><em>I've found that many therapists describe themselves as just \"neurodivergent\" on other websites without specifying whether they're autistic, possibly for safety/anti-discrimination reasons. So for autistic clients, it is incredibly helpful to be able to see the very clear \"Autistic Person\" tag here. </em></p>\n<p><em>I would personally recommend looking for the \"<a href=\"https://aylins-autisticresources.org/post-2/\"><span style=\"text-decoration: underline;\">Autism-Affirming or Centered Therapy</span></a>\" and \"Autistic Person Opposing ABA\" tags as well!</em> </p>\n</blockquote>\n<p>Another cool tag I spotted is \"Cultural Resistance Against Systemic Oppression,\" if you'd prefer to rage against the system (i.e. our collective oppression) and not unduly against yourself (an individual inside of an abusive system). I'd consider this another promising indicator of decolonized therapy.</p>\n<p>All in all, I've found this to be a great resource when searching for neuro-affirming therapy, especially as a holder of Many Identities™. So if you're looking for an autistic therapist, or one who shares particular ideals and/or demographics with you, this is a mighty useful website to consult!</p>",
            "image": "https://aylins-autisticresources.org/media/posts/12/inclusivetherapists.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Websites",
                   "People of Color (POC)",
                   "Neuro-Affirming Therapy",
                   "LGBTQ+"
            ],
            "date_published": "2026-02-03T20:11:16-08:00",
            "date_modified": "2026-02-08T12:45:32-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/autistic-culture-podcast/",
            "url": "https://aylins-autisticresources.org/autistic-culture-podcast/",
            "title": "Autistic Culture Podcast",
            "summary": "The Autistic Culture Podcast is/was a podcast that reimagines autism as a cultural difference as well as a neurological one.",
            "content_html": "<h5>The <em><span style=\"text-decoration: underline;\"><a href=\"https://www.autisticculturepodcast.com/podcast\">Autistic Culture Podcast</a></span></em> is/was a podcast that reimagines autism as a cultural difference as well as a neurological one. </h5>\n<p>For the first approximately 129 episodes of this podcast, the hosts were Matt Lowry, LPP and Dr. Angela Kingdon, who discussed various sociocultural aspects of Autistic culture (as opposed to the dominant neurotypical culture we live in). In the imagined <span style=\"text-decoration: underline;\"><a href=\"https://www.mattlowrylpp.com/blog/autistica\">Land of Autistica</a></span>, a fable written by Matt, autistic people are surrounded by their own neurokin in a world made for them, unlike the world of forced neurotypicality.</p>\n<p>The podcast delved into the history of autistic contributions to society and did Autistic Advocacy episodes on important issues that affect our community. I found the humor between the hosts to be pretty delightful, and the conversations it had were super important in a society that often seeks to \"fix\" autism instead of accommodate or embrace it.</p>\n<p>This is quite a well-known autistic podcast, and the first ~100ish episodes are largely a funny and informative listen that provided me with a sort of pseudo-<span style=\"text-decoration: underline;\"><a href=\"https://www.autisticculturepodcast.com/p/autistic-podcast-autistic-centered-therapy\">autistic therapy</a></span> during a time when I needed it.</p>\n<blockquote>\n<p><em>It's not a perfect podcast, but it genuinely meant a lot to me to hear two autistic adults have fun together and explore the wonders of Autistica. I sincerely wish it were a real place I could visit.</em></p>\n</blockquote>\n<p>Unfortunately, Matt is no longer a host; however, I still recommend the original first ~three seasons of the podcast for their quality and enjoyability. Feel free to check out Matt's new podcast, the <em><span style=\"text-decoration: underline;\"><a href=\"https://www.mattlowrylpp.com/voice\">Autistic V.O.I.C.E. Project</a></span></em>, as well.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/11/autistic-culture-pod.jpg",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Podcasts"
            ],
            "date_published": "2026-02-01T18:30:42-08:00",
            "date_modified": "2026-02-03T20:19:15-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/embrace-autism/",
            "url": "https://aylins-autisticresources.org/embrace-autism/",
            "title": "Embrace Autism",
            "summary": "Embrace Autism is a website that offers free, at-home assessment resources and advocates for positive autism education. It's run by&hellip;",
            "content_html": "<h5><a href=\"https://embrace-autism.com/\"><span style=\"text-decoration: underline;\">Embrace Autism</span></a> is a website that offers free, at-home assessment resources and advocates for positive autism education.</h5>\n<p>It's run by Dr. Natalie Engelbrecht and Eva Silvertant, who are both autistic (and seem to have a pretty hardcore special interest in autism ;). </p>\n<blockquote>\n<p><em>Embrace Autism is well known for having many clinically validated <a href=\"https://embrace-autism.com/autism-tests/\"><span style=\"text-decoration: underline;\">autism questionnaires</span></a> that you can do at home for free. This is super helpful, since official assessments are not always easily accessible.</em></p>\n<p><em>However, if you do want to go the formal route, you can also book an assessment with one of their neurodivergent practitioners if you'd like. (Bring your binder full of test scores with you!)</em></p>\n</blockquote>\n<p>Part of my early autism journey was obsessively taking every single inventory on this website to try to figure out whether I might be autistic. Unsurprisingly, the answer was a choral, harmonized, resounding <em>yes</em>... from all of them. :) It's a great place to start if you're wondering whether you might be as well.</p>\n<p>On top of that, they also have hundreds of blog posts on a diverse variety of autism-related subjects. Some I found particularly interesting are \"<a href=\"https://embrace-autism.com/selective-mutism-in-autistic-adults/\"><span style=\"text-decoration: underline;\">Selective Mutism in Autistic Adults</span></a>,\" \"<a href=\"https://embrace-autism.com/finding-an-autism-affirming-therapist/\"><span style=\"text-decoration: underline;\">Finding an Autism-Affirming Therapist</span></a>,\" and \"<span style=\"text-decoration: underline;\"><a href=\"https://embrace-autism.com/autism-and-disorganized-thoughts/\">Autism and Disorganized Thoughts</a></span>\" (or nonlinear thinking). Their wealth of content is so fascinating and well researched that it was VERY HARD to tear myself away from it in order to write this!</p>\n<p>Overall, Embrace Autism's combination of online self-assessments, charming graphic design, and empowering messages make it an ideal hub of autism-affirming information, especially for people who are just starting to explore whether they may be autistic.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/10/embrace-autism.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Websites",
                   "AuDHD",
                   "Articles"
            ],
            "date_published": "2026-02-01T18:26:21-08:00",
            "date_modified": "2026-02-06T21:08:43-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/unmasking-autism-discovering-the-new-faces-of-neurodiversity/",
            "url": "https://aylins-autisticresources.org/unmasking-autism-discovering-the-new-faces-of-neurodiversity/",
            "title": "Unmasking Autism: Discovering the New Faces of Neurodiversity",
            "summary": "Unmasking Autism by Dr. Devon Price is a book primarily about diverse, high-masking autistic people, including women, queer &amp; trans&hellip;",
            "content_html": "<h5><em><span style=\"text-decoration: underline;\"><a href=\"https://bookshop.org/p/books/unmasking-autism-discovering-the-new-faces-of-neurodiversity-devon-price-phd/1e7c1b4d1e3069d8\">Unmasking Autism</a></span></em> by Dr. Devon Price is a book primarily about diverse, high-masking autistic people, including women, queer &amp; trans people, and people of color.</h5>\n<p>This book is a great introduction to autism, especially if you're a high-masking autistic person with a non-stereotypical presentation of traits. You'll learn how maskers camouflage and mimic neurotypical social cues to \"blend in\" and survive, which can, of course, lead to autistic burnout and exhaustion.</p>\n<p>It also features research and personal stories of late-diagnosed individuals, especially people in the LGBTQ+ community and other marginalized groups. Price is a transgender, autistic social psychologist himself, which is much-needed representation in the field.</p>\n<blockquote>\n<p><em>Importantly, Price argues that the world needs to change to be more accepting and accommodating of autistic people, not the other way around.</em></p>\n<p><em>The book feels validating, educational, and neurodivergence-positive, which is especially ideal if you're new to the big, sometimes daunting world of autism.</em></p>\n</blockquote>\n<p>This was the first book about autism I ever read, and boy am I glad it was this one. It's pretty well-known for being the go-to inclusive book for the socially conscious, enlightened autie. It even has advice on finding autistic community, which is incredibly beneficial for readers who might feel increasingly alone when discovering their neurotype for the first time.</p>\n<p>Ironically, this book made me realize that I am in fact not high-masking, or masking at all! (Except for some stimming that I can sort of hide when needed.) Nor am I particularly non-stereotypical. However, if even my stereotypical autistic ass gleaned something from this book, that's a pretty good sign for everyone else. ;)</p>\n<p>There's also a sequel to this book called <span style=\"text-decoration: underline;\"><a href=\"https://bookshop.org/p/books/unmasking-for-life-the-autistic-person-s-guide-to-connecting-loving-and-living-authentically-devon-price-phd/8f56261bb34b67ca?ean=9780593735756&amp;next=t&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=%7Bcampaignname%7D&amp;utm_content=6443417794&amp;gad_source=1&amp;gad_campaignid=16235479093&amp;gbraid=0AAAAACfld43NWHsyz8C-vyzn047pEyHeV&amp;gclid=Cj0KCQiA7fbLBhDJARIsAOAqhseIDnUuxINrzFgYHrAvWSHXhN_ELU2VdPDvj1Zvp2l6GeCrJqcbTyoaAs9mEALw_wcB\"><em>Unmasking for Life: The Autistic Person's Guide to Connecting, Loving, and Living Authentically</em></a></span>, if you're looking for more.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/9/unmaskingautism-2.jpg",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "LGBTQ+",
                   "Books"
            ],
            "date_published": "2026-01-31T18:07:43-08:00",
            "date_modified": "2026-01-31T19:42:01-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/focus-friend/",
            "url": "https://aylins-autisticresources.org/focus-friend/",
            "title": "Focus Friend",
            "summary": "Focus Friend is a cute, bean-themed focus timer app by Hank Green and Honey B Games to help you stop&hellip;",
            "content_html": "<h5><a href=\"https://www.yourfocusfriend.com/\"><span style=\"text-decoration: underline;\">Focus Friend</span></a> is a cute, bean-themed focus timer app by Hank Green and Honey B Games to help you stop using your phone so damn much.</h5>\n<p>This app bestows upon you a cozy little bean friend who knits socks. When you click the FOCUS! button, lil' Beanie (or whatever you named them) starts knitting and locks your phone. During this time, you cannot access any other app. When you're done, you can spend the socks you earned on adorable furniture to decorate Beanie's home.</p>\n<p>If you violate this and interrupt Beanie's knitting to use your phone, they get very sad. :( You don't want to make Beanie <em>sad</em>, do you? Bean tears are notoriously acidic! (Which is to say, making you feel guilt and shame for disappointing a cartoon bean is the tactic at play here. It's pretty effective.)</p>\n<p>Focus Friend is marketed as especially useful for people with ADHD, but I think it's helpful even for non-ADHD autistic people like me, who might struggle to transition from \"looking at your phone\" to \"not looking at your phone and doing literally anything else.\" :)</p>\n<blockquote>\n<p class=\"msg\"><em>It's certainly not the only focus timer app out there, but it may well be the most charming.</em></p>\n</blockquote>\n<p>The app runs on optional in-game purchases (no ads) and is available on <a href=\"https://play.google.com/store/apps/details?id=com.underthing.focus.friend&amp;hl=en_US\"><span style=\"text-decoration: underline;\">Android</span></a> and <span style=\"text-decoration: underline;\"><a href=\"https://apps.apple.com/us/app/focus-friend-by-hank-green/id6742278016\">Apple</a></span> devices for free!</p>",
            "image": "https://aylins-autisticresources.org/media/posts/8/focus-friend-2.jpg",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Mobile Apps",
                   "AuDHD"
            ],
            "date_published": "2026-01-31T17:37:32-08:00",
            "date_modified": "2026-02-03T20:13:04-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/how-we-feel/",
            "url": "https://aylins-autisticresources.org/how-we-feel/",
            "title": "How We Feel",
            "summary": "How We Feel is a mobile journaling app designed by therapists and scientists at the Yale University Center for Emotional&hellip;",
            "content_html": "<h5><span style=\"text-decoration: underline;\"><a href=\"https://howwefeel.org/\"><em>How We Feel</em></a></span> is a mobile journaling app designed by therapists and scientists at the <span style=\"text-decoration: underline;\"><a href=\"http://ycei.org/\" target=\"_blank\" data-v-735c43b9=\"\" rel=\"noopener\">Yale University Center for Emotional Intelligence</a></span> to help you name and track your emotions throughout the day.</h5>\n<p>The app taps you on the shoulder (via notifications) once or twice a day, or however frequently you want it to, and asks how you're feeling in that moment. You can type it in the search bar if you already have a word for what you're feeling.</p>\n<p>But if you need help naming it, you can browse through the emotions on the feelings wheel, which are organized by <strong><em>arousal </em></strong>(high or low) and <strong><em>valence </em></strong>(positive or negative). For example, \"excited\" is listed as a high energy, pleasant emotion, whereas \"disconnected\" is a low energy, unpleasant emotion.</p>\n<p>Each emotion has a specific description, which is helpful for choosing between similar feelings, such as \"angry\" and \"furious.\" The differences can be somewhat subjective, but I usually at least somewhat agree with their definitions.</p>\n<p>Once you choose a feeling, you're asked what might be making you feel that way. You can quickly pick customizable tags for <em><strong>themes </strong></em>(e.g. driving, resting, reading, gaming), <em><strong>people </strong></em>(e.g. friends, family, co-workers, alone), and <em><strong>places </strong></em>(e.g. home, school, work). This has really helped me notice how certain situations and activities consistently make me feel.</p>\n<blockquote>\n<p>How We Feel <em>is especially handy for people with alexithymia, which can make it hard to recognize or describe your feelings.</em></p>\n<p><em>When there's literally a log of your emotions and what caused them colorfully staring you in the face, it's pretty hard to deny the patterns that show up.</em></p>\n</blockquote>\n<p>The design of the app is beautiful and easy to use as well, with each emotion taking a unique shape evocative of that feeling. It's available on <span style=\"text-decoration: underline;\"><a href=\"https://play.google.com/store/apps/details?id=org.howwefeel.moodmeter&amp;hl=en_US\">Android</a></span> and <span style=\"text-decoration: underline;\"><a href=\"https://apps.apple.com/us/app/how-we-feel/id1562706384\">Apple</a></span> devices for free!</p>",
            "image": "https://aylins-autisticresources.org/media/posts/7/howwefeel2.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Mobile Apps"
            ],
            "date_published": "2026-01-30T17:12:01-08:00",
            "date_modified": "2026-02-03T20:12:54-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-3/",
            "url": "https://aylins-autisticresources.org/post-3/",
            "title": "I&#x27;m Autistic, Now What?",
            "summary": "I'm Autistic, Now What? is a YouTube channel run by Meg, a late-diagnosed PDA AuDHD woman from the UK. Meg&hellip;",
            "content_html": "<h5><em><span style=\"text-decoration: underline;\"><a href=\"https://www.youtube.com/@imautisticnowwhat/playlists\">I'm Autistic, Now What?</a></span></em> is a YouTube channel run by Meg, a late-diagnosed PDA AuDHD woman from the UK. Meg is one of the most well-known autistic YouTubers out there, for good reason.</h5>\n<p>She has videos on signs that you might have autism, ADHD, PDA, and/or dyspraxia, as well as signs that you might NOT be neurodivergent in these ways. In addition, her videos on monotropism and masking are excellent introductions to the topics, and her advice videos are always quite thorough. She also has a neurotypical partner and child, which gives her an interesting comparative perspective.</p>\n<p>This channel is especially great for people who have just been diagnosed or are questioning their neurotype. The title <em>I'm Autistic, Now What?</em> refers to the all-too-common experience of finally finding out you're autistic — and then being left with no support, just a slap on the back and a \"good luck, buddy!\" (If that. :)</p>\n<blockquote>\n<p><em>With her channel, Meg is trying to correct that by making enjoyable content for people figuring out how to live a better autistic life post-diagnosis.</em></p>\n<p><em>It's clear that Meg puts a lot of time and effort into research, citing her sources, and talking about autism in a charming, relatable, and accurate way.</em></p>\n</blockquote>\n<p>I recommend her <span style=\"text-decoration: underline;\"><a href=\"https://www.youtube.com/playlist?list=PLEHi2YmjD7gEssdqTn0247t_niQMt2b22\">meme compilation</a></span> videos when you need a good autistic chuckle amidst the world's copious darkness. Also, note that some of her videos have sarcastic titles quoting other people's questionable statements that she is, of course, arguing against.</p>\n<p>Meg has a <span style=\"text-decoration: underline;\"><a href=\"https://www.patreon.com/imautisticnowwhat\">Patreon</a></span> where she offers access to her Discord server at a very low price, and sometimes she releases merch, like Anti-Social Snail pins and stickers. Overall, her channel is a fun way to engage with the autistic community, learn something, and feel like maybe we're not all totally screwed.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/6/meg-2.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "YouTube",
                   "Persistent Drive for Autonomy (PDA)",
                   "AuDHD"
            ],
            "date_published": "2026-01-11T18:08:13-08:00",
            "date_modified": "2026-01-31T17:38:10-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-2/",
            "url": "https://aylins-autisticresources.org/post-2/",
            "title": "AuCT - What is Autistic-Centered Therapy?",
            "summary": "Autistic-Centered Therapy (AuCT) is neuro-affirming therapy designed by and for autistic people. According to Matt Lowry, LPP, it's \"equal parts&hellip;",
            "content_html": "<h5><span style=\"text-decoration: underline;\"><a href=\"https://www.mattlowrylpp.com/blog/act-83tka\"><span style=\"font-weight: 400;\">Autistic-Centered Therapy</span><span style=\"font-weight: 400;\"> (AuCT)</span></a></span><span style=\"font-weight: 400;\"> is neuro-affirming therapy designed by and for autistic people. According to Matt Lowry, LPP, it's \"equal parts trauma work, advocacy work, autistic interpersonal therapy, and automotive [body] maintenance.\"</span></h5>\n<p><span style=\"font-weight: 400;\">I came across the idea of autistic-centered therapy through the Autistic Culture Podcast, where they did an </span><span style=\"text-decoration: underline;\"><a href=\"https://www.autisticculturepodcast.com/p/autistic-podcast-autistic-centered-therapy\"><span style=\"font-weight: 400;\">episode about AuCT</span></a></span><span style=\"font-weight: 400;\">. It reimagines what therapy might look like if it affirmed neurodivergence, encouraged autistic coping strategies, and were administered by an <a href=\"https://aylins-autisticresources.org/inclusivetherapistscom/\"><span style=\"text-decoration: underline;\">autistic therapist</span></a> who understands and </span><span style=\"font-weight: 400;\">uses</span><span style=\"font-weight: 400;\"> autistic communication styles themselves.</span></p>\n<p><span style=\"font-weight: 400;\">The most common kind of therapy in the US is Cognitive Behavioral Therapy (CBT), and my personal experience as an autistic person is that multiple facets of it simply do not work for me. In some cases, they can actually harm my mental health, even if delivered with nothing but good intentions. </span></p>\n<p><span style=\"font-weight: 400;\">These sentiments have been echoed by many autistic people who find that most available types of therapy are either made for neurotypical/allistic people or attempts to \"fix\" our autism. Neither is ideal!</span></p>\n<blockquote>\n<p><em><span style=\"font-weight: 400;\">The concept of AuCT gives me some hope for a world where autism-affirming therapy is accessible to anyone who needs it.</span></em></p>\n</blockquote>\n<p><span style=\"font-weight: 400;\">This article and podcast episode made me feel much more educated on what to look for when searching for a therapist myself. Thus, I highly recommend them to any autistic person who feels like traditional therapy might not be for them, as well as any clinician interested in learning more about how to support autistic clients.</span></p>",
            "image": "https://aylins-autisticresources.org/media/posts/5/AuCT.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Podcasts",
                   "Neuro-Affirming Therapy",
                   "Articles"
            ],
            "date_published": "2026-01-11T18:08:10-08:00",
            "date_modified": "2026-02-07T20:33:25-08:00"
        },
        {
            "id": "https://aylins-autisticresources.org/post-1/",
            "url": "https://aylins-autisticresources.org/post-1/",
            "title": "Me and Monotropism: A unified theory of autism",
            "summary": "Monotropism is a unified theory of autism created by autistic people that explains autistic traits in terms of \"monotropic,\" or&hellip;",
            "content_html": "<h5>Monotropism is a <span style=\"text-decoration: underline;\"><a href=\"https://www.bps.org.uk/psychologist/me-and-monotropism-unified-theory-autism\">unified theory of autism</a></span> created by autistic people that explains autistic traits in terms of \"monotropic,\" or singularly and intensely focused, attention.</h5>\n<p>It was developed by Dr. Dinah Murray, Dr. Wenn Lawson, and Mike Lesser. This article about it was written by Dr. Murray's adult child, Fergus Murray, both of whom were/are autistic themselves.</p>\n<p>Many people's understanding of autism is still extremely deficit-based. On the other hand, the theory of monotropism is one of the first, most prominent theories of autism that sees autistic traits primarily as differences, not deficiencies.</p>\n<blockquote>\n<p><em>When I was still confused about whether I was autistic or not, reading this article was what made it all make sense. It does a shockingly cohesive job of tying seemingly disparate autistic traits together with the common thread of singular, intense focus.</em></p>\n<p><em>I've recommended it to countless people since when trying to explain the root of what autism is all about, as I think it's a great starting point.</em></p>\n</blockquote>\n<p>Fergus Murray also has a website called <span style=\"text-decoration: underline;\"><a href=\"https://monotropism.org/\">monotropism.org</a></span> with more details on the history of the theory, its applications, and other articles and papers on monotropism.</p>",
            "image": "https://aylins-autisticresources.org/media/posts/4/trees.png",
            "author": {
                "name": "emily"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2026-01-10T19:11:44-08:00",
            "date_modified": "2026-01-30T16:56:26-08:00"
        }
    ]
}
